7767517
96 110
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 9=1
ConvolutionDepthWise     convdwrelu_0             1 1 1 2 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              convrelu_1               1 1 2 3 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 3 4 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32 9=1
Convolution              convrelu_2               1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 5 6 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              convrelu_3               1 1 6 7 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
ConvolutionDepthWise     convdwrelu_3             1 1 7 8 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32 9=1
Convolution              convrelu_4               1 1 8 9 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
ConvolutionDepthWise     convdwrelu_4             1 1 9 10 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              convrelu_5               1 1 10 11 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
ConvolutionDepthWise     convdwrelu_5             1 1 11 12 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              convrelu_6               1 1 12 13 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Split                    splitncnn_0              1 4 13 14 15 16 17
Convolution              conv_8                   1 1 17 18 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Convolution              convrelu_7               1 1 18 19 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 9=1
Convolution              conv_10                  1 1 19 20 0=16 1=3 11=3 12=2 13=1 14=2 2=2 3=1 4=2 5=1 6=2304
Convolution              conv_11                  1 1 16 21 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Convolution              convrelu_8               1 1 21 22 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 9=1
Convolution              conv_13                  1 1 22 23 0=16 1=3 11=3 12=3 13=1 14=3 2=3 3=1 4=3 5=1 6=2304
Convolution              conv_14                  1 1 15 24 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Convolution              convrelu_9               1 1 24 25 0=12 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 9=1
Convolution              convrelu_10              1 1 25 26 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 9=1
Convolution              conv_17                  1 1 26 27 0=16 1=3 11=3 12=5 13=1 14=5 2=5 3=1 4=5 5=1 6=2304
Concat                   cat_0                    3 1 20 23 27 28 0=0
Convolution              conv_18                  1 1 28 29 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_19                  1 1 14 30 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_0                    2 1 29 30 31 0=0
ReLU                     relu_56                  1 1 31 32
Split                    splitncnn_1              1 4 32 33 34 35 36
ConvolutionDepthWise     convdwrelu_6             1 1 36 37 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              convrelu_11              1 1 37 38 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
ConvolutionDepthWise     convdwrelu_7             1 1 38 39 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_12              1 1 39 40 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_8             1 1 40 41 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_13              1 1 41 42 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Split                    splitncnn_2              1 4 42 43 44 45 46
ConvolutionDepthWise     convdwrelu_9             1 1 46 47 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_14              1 1 47 48 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
ConvolutionDepthWise     convdwrelu_10            1 1 48 49 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_15              1 1 49 50 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Split                    splitncnn_3              1 4 50 51 52 53 54
Convolution              convrelu_16              1 1 51 55 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_11            1 1 55 56 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              convrelu_17              1 1 56 57 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Split                    splitncnn_4              1 3 57 58 59 60
ConvolutionDepthWise     convdwrelu_12            1 1 35 61 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              conv_27                  1 1 61 62 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Permute                  permute_79               1 1 62 63 0=3
ConvolutionDepthWise     convdwrelu_13            1 1 34 64 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              conv_28                  1 1 64 65 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Permute                  permute_80               1 1 65 66 0=3
ConvolutionDepthWise     convdwrelu_14            1 1 33 67 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              conv_29                  1 1 67 68 0=30 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1920
Permute                  permute_81               1 1 68 69 0=3
ConvolutionDepthWise     convdwrelu_15            1 1 45 70 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              conv_30                  1 1 70 71 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Permute                  permute_82               1 1 71 72 0=3
ConvolutionDepthWise     convdwrelu_16            1 1 44 73 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              conv_31                  1 1 73 74 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Permute                  permute_83               1 1 74 75 0=3
ConvolutionDepthWise     convdwrelu_17            1 1 43 76 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              conv_32                  1 1 76 77 0=20 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2560
Permute                  permute_84               1 1 77 78 0=3
ConvolutionDepthWise     convdwrelu_18            1 1 54 79 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              conv_33                  1 1 79 80 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Permute                  permute_85               1 1 80 81 0=3
ConvolutionDepthWise     convdwrelu_19            1 1 53 82 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              conv_34                  1 1 82 83 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Permute                  permute_86               1 1 83 84 0=3
ConvolutionDepthWise     convdwrelu_20            1 1 52 85 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              conv_35                  1 1 85 86 0=20 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5120
Permute                  permute_87               1 1 86 87 0=3
Convolution              conv_36                  1 1 60 88 0=12 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648
Permute                  permute_88               1 1 88 89 0=3
Convolution              conv_37                  1 1 59 90 0=6 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=13824
Permute                  permute_89               1 1 90 91 0=3
Convolution              conv_38                  1 1 58 92 0=30 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=69120
Permute                  permute_90               1 1 92 93 0=3
Reshape                  reshape_91               1 1 63 94 0=4 1=4800
Reshape                  reshape_92               1 1 72 95 0=4 1=800
Reshape                  reshape_93               1 1 81 96 0=4 1=200
Reshape                  reshape_94               1 1 89 97 0=4 1=75
Concat                   cat_1                    4 1 94 95 96 97 out0 0=0
Reshape                  reshape_95               1 1 66 99 0=2 1=4800
Reshape                  reshape_96               1 1 75 100 0=2 1=800
Reshape                  reshape_97               1 1 84 101 0=2 1=200
Reshape                  reshape_98               1 1 91 102 0=2 1=75
Concat                   cat_2                    4 1 99 100 101 102 103 0=0
Reshape                  reshape_99               1 1 69 104 0=10 1=4800
Reshape                  reshape_100              1 1 78 105 0=10 1=800
Reshape                  reshape_101              1 1 87 106 0=10 1=200
Reshape                  reshape_102              1 1 93 107 0=10 1=75
Concat                   cat_3                    4 1 104 105 106 107 out2 0=0
Softmax                  softmax_0                1 1 103 out1 0=1 1=1
